system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}

castellatedMesh     true;
snap                true;
addLayers           true;

geometry
{
    darkstarFilledScaledDown.stl
    {
        type        triSurfaceMesh;
        name        darkstarFilledScaledDown;
    }

    refinementBox
        // tight refinement box around rocket body
        // adjust bounds to match actual rocket extents
    {
        type        searchableBox;
        min         (-0.1 -0.15 -0.15);
        max         (1.1 0.15 0.15);
    }

    wakeBox
        // wake refinement region downstream
    {
        type        searchableBox;
        min         (1 -0.3 -0.3);
        max         (3 0.3 0.3);
    }
}

castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      8000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file        "darkstarFilledScaledDown.eMesh";
            level       2;
        }
    );

    refinementSurfaces
    {
        darkstarFilledScaledDown
        {
            level (3 5);                    // (min max) refinement level on surface
            patchInfo
            {
                type    wall;
            }
        }
    }

    resolveFeatureAngle     30;

    refinementRegions
    {
        refinementBox
        {
            mode        inside;
            levels      ((1E15 3));
        }

        wakeBox
        {
            mode        inside;
            levels      ((1E15 2));
        }

        darkstarFilledScaledDown
        {
            mode        inside;
            levels      ((1E15 5));
        }
    }
    locationInMesh      (0.5 1.0 1.0);
        // must be a point outside the rocket but inside the domain
        // should be adjusted to a free-stream location well away from geometry
}

snapControls
{
    nSmoothPatch        3;
    tolerance           4.0;
    nSolveIter          300;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

addLayersControls
{
    relativeSizes       true;

    layers
    {
        darkstarFilledScaledDown
        {
            nSurfaceLayers  3;          // 3 layers is adequate for wall functions y+ = 30-300
        }
    }

    expansionRatio          1.2;
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              3;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio   0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minVol                  1e-13;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.05;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;

    relaxed
    {
        maxNonOrtho         75;
    }
}

writeFlags
(
    scalarLevels
);

mergeTolerance              1e-06;