constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType  RAS;

RAS
{
    model           komegaSST;

    turbulence      on;

    printCoeffs     on;

    // default Menter (1994) SST coeffs
    // alphaK1      0.85;
    // alphaK2      1.0;
    // alphaOmega1  0.5;
    // alphaOmega2  0.856;
    // gamma1       0.5556;
    // gamma2       0.44;
    // beta1        0.075;
    // beta2        0.0828;
    // betaStar     0.09;
    // a1           0.31;
    // b2           1.0;
    // c1           10.0;
    // F3           false;
}