0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

//turbulence - komegaSST
//I = 0.1%
//L = 0.001567m (1% of D=0.1567m)
//k = 1.5(UI)^2 = 1.5((303.1)(0.001))^2 = 0.1379 m^2/s^2

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1379;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.001; //I = 0.001
        value           uniform 0.1379;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1379;
        value           uniform 0.1379;
    }

    darkstarFilledScaledDown
    {
        type            kqRWallFunction;
        value           uniform 0.1379;
    }

    farfield
    {
        type            freestream;
        freestreamValue uniform 0.1379;
    }

    symmetry
    {
        type            symmetryPlane;
    }
}