0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

//turbulent kinematic viscosity
//Initial: nut = k/omega = 0.1379/140700 = 9.8e-7 m^2/s

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 9.8e-07;

boundaryField
{
    inlet
    {
        type        calculated;
        value       uniform 9.8e-07;
    }

    outlet
    {
        type        calculated;
        value       uniform 9.8e-07;
    }

    darkstarFilledScaledDown
    {
        type        nutkWallFunction;
        value       uniform 9.8e-07;
    }

    farfield
    {
        type        calculated;
        value       uniform 9.8e-07;
    }

    symmetry
    {
        type        symmetryPlane;
    }
}