system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location   "system";
    object      decomposeParDict;
}

numberOfSubdomains      8;
    // adjust numberOfSubdomains to your core count

method                  scotch;
    // automatic load-based decomposition
    // no need to specify coeffs
    // alternative method: hierarchical decomposition
        // method   hierarchical;
        // hierarchicalCoeffs
        // {
        //      n       (4 2 1);    // 4x2x1 = 8 cores
        //      delta   0.001;
        //      order   xyz;
        // }